import Cover from "@/components/main/Cover/Cover";
import Loading from "@/components/main/Loading/Loading";
import Product from "@/components/main/Product/Product";
import ProductGrid from "@/components/main/ProductGrid/ProductGrid";
import { Metadata, ResolvingMetadata } from "next";

const pageName = "rental-product";

export async function generateMetadata(
  { params, searchParams }: any,
  parent: ResolvingMetadata
): Promise<Metadata> {
  // read route params
  const lng = "TH";

  const seoRoute = `${process.env.NEXT_PUBLIC_BACK_END_URL}/api/v1/page/seo/page-name/${pageName}`;

  // fetch data
  const response = await fetch(seoRoute, { cache: "no-store" }).then((res) =>
    res.json()
  );

  return {
    title: response[`seoTitle${lng}`],
    description: response[`seoDescription${lng}`],
    keywords: response[`seoKeyword${lng}`],
  };
}

const fetchCat = async () => {
  const res = await fetch(
    `${process.env.NEXT_PUBLIC_BACK_END_URL}/api/v1/page/category-main`,
    { cache: "no-store" }
  );
  const data = await res.json();

  return data.rows.filter((i: any) => i?.type == "rent" || i?.type == "both");
};
export default async function RentPage() {
  const data = await fetchCat();
  return (
    <>
      <Loading />
      <Cover
        pageName={
          "บริษัท เร้นท์ (ประเทศไทย) จำกัด บริการ ให้เช่าเครื่องจักร งานก่อสร้าง"
        }
        prevPage={{ pageName: "หน้าแรก", url: "/" }}
      />
      <div className="container mx-auto">
        <Product type={"rent"} main={data} />
        <div className="flex flex-col gap-4 text-slate-600 pb-4">
          <h2 className="text-center font-semibold text-2xl text-[#0FA1DD]">
            บริษัท เร้นท์ (ประเทศไทย) จำกัด บริการ ให้เช่าเครื่องจักร
            งานก่อสร้าง
          </h2>
          <p>
            หากคุณต้องการ เช่าเครื่องจักร และเครื่องมือสำหรับใช้ในงานก่อสร้าง
            เราคือ บริษัทให้บริการเช่าเครื่องจักร งานก่อสร้าง
            ที่มีสินค้าให้เช่ากว่า 460 ประเภท เป็นจำนวนกว่า 5,000 ชิ้น
            และสามารถนำเครื่องจักรที่ยังไม่เป็นที่รู้จักในประเทศไทยเข้ามาปล่อยเช่าได้อย่างรวดเร็ว
            ในฐานะผู้บุกเบิกตลาดงานเช่า
            และยังเป็นบริษัทเพียงเจ้าเดียวในประเทศไทยที่มีเครื่องทดสอบอุปกรณ์ยก
            ปฏิบัติงานด้วยความปลอดภัย รวดเร็ว และใส่ใจสิ่งแวดล้อม
          </p>
          <h3 className="text-center font-semibold text-2xl text-[#0FA1DD]">
            มีบริการให้เช่าเครื่องจักรที่หลากหลาย
            สามารถเลือกได้เหมาะกับการใช้งาน
          </h3>
          <p>
            บริษัท ของเรามีบริการ ให้เช่าเครื่องจักร งานก่อสร้าง หลายประเภท
            เราเชื่อว่าการเลือกเครื่องจักรให้เหมาะสมกับการใช้งานนั้นจะทำให้การทำงานรวดเร็วและมีประสิทธิภาพอย่างสูงที่สุด
            ไม่ว่าจะเป็น
          </p>
          <ul className="pl-10">
            <li className="list-disc">ให้เช่าเครื่องจักรกลหนัก</li>
            <li className="list-disc">ให้เช่าเครื่องจักรงานก่อสร้าง</li>
            <li className="list-disc">ให้เช่าเครื่องจักรอุตสาหกรรม</li>
            <li className="list-disc">ให้เช่าเครื่องจักรหนักรื้อถอน</li>
            <li className="list-disc">ให้เช่าเครื่องจักรหนัก ขนาดใหญ่</li>
            <li className="list-disc">ให้เช่าเครื่องจักรที่ใช้ในงานโยธา</li>
            <li className="list-disc">
              ให้เช่าอุปกรณ์ที่ใช้ในการติดตั้งเครื่องจักร
            </li>
            <li className="list-disc">ให้เช่าเครื่องจักรงานซ่อมบำรุงโรงงาน</li>
            <li className="list-disc">รถเช่า</li>
          </ul>
          <p>
            เราให้เช่าเครื่องจักรคุณภาพดีครอบคลุมทุกงานก่อสร้าง งานอุตสาหกรรม
            และงานอื่น ๆ ที่ต้องอาศัยเครื่องจักรและอุปกรณ์ที่หลากหลาย
            โดยที่ท่านไม่จำเป็นต้องซื้อเพื่อบริหารค่าใช้จ่ายไม่ให้เกินความจำเป็น
            แต่ท่านสามารถใช้ บริการให้เช่าเครื่องจักร กับเราได้ด้วย
            ราคาเช่าเครื่องจักร ที่เป็นมิตร
            เน้นการใช้ประโยชน์และตอบโจทย์ทุกการใช้งาน
          </p>
          <h3 className="text-center font-semibold text-2xl text-[#0FA1DD]">
            พื้นที่บริการเช่าเครื่องจักรก่อสร้างและอุปกรณ์ต่าง ๆ
          </h3>
          <p>
            เราพร้อมให้บริการท่านครอบคลุม
            โดยเน้นบริเวณภาคตะวันออกและภาคกลางเป็นหลักไม่ว่าจะเป็น
          </p>
          <ul className="pl-10">
            <li className="list-disc">
              ภาคกลาง ให้เช่าเครื่องจักรสมุทรปราการ กรุงเทพ และปริมณฑลทุกพื้นที่
              ให้เช่าเครื่องจักรปทุมธานี ให้เช่าเครื่องจักรอยุธยา ฯลฯ
            </li>
            <li className="list-disc">
              ภาคตะวันออก ให้เช่าเครื่องจักร ชลบุรี ให้เช่าเครื่องจักร ระยอง
              ให้เช่าเครื่องจักร มาบตาพุด ฯลฯ
            </li>
            <li className="list-disc">
              ภาคตะวันออกเฉียงเหนือ ให้เช่าเครื่องจักร ขอนแก่น นครราชสีมา ฯลฯ
            </li>
            <li className="list-disc">
              ภาคตะวันตก ให้เช่าเครื่องจักร ประจวบคีรีขันธ์ กาญจนบุรี ฯลฯ
            </li>
            <li className="list-disc">
              ภาคเหนือและภาคใต้จะอยู่ห่างไกลจากสาขาของเรา
              แต่สามารถพิจารณาให้บริการเช่าได้เป็นกรณีไป
              โดยจะให้เช่าในลักษณะที่ไม่มีบริการซ่อมบำรุง
            </li>
          </ul>
          <h3 className="text-center font-semibold text-2xl text-[#0FA1DD]">
            ทำไมถึงต้องเลือกเช่าเครื่องจักรกับเรา
          </h3>
          <ul className="pl-10">
            <li className="list-disc">
              เรามีสินค้าที่ให้บริการ เครื่องจักรให้เช่า ที่หลากหลาย 450 ประเภท
              เป็นจำนวนกว่า 5,000 ชิ้น
            </li>
            <li className="list-disc">
              เรามีการจัดตั้งศูนย์ซ่อมบำรุงเครื่องจักร มุ่งเน้นให้บริการ
              ให้เช่าเครื่องจักรคุณภาพดี แก่ลูกค้า
            </li>
            <li className="list-disc">
              เราได้จัดตั้งหน่วยงานพิเศษเพื่อดูแลและเน้นควบคุมคุณภาพของเครื่องมือเฉพาะทาง
              รวมถึงมีการสอบเทียบคุณภาพและความแม่นยำสำหรับอุปกรณ์วัดต่าง ๆ
              อย่างสม่ำเสมอ เน้นถึงความปลอดภัยแก่ลูกค้าเป็นหลัก
            </li>
            <li className="list-disc">
              เรานำเข้าเครื่องมือช่วยในการดันสายไฟมาจากประเทศญี่ปุ่นเป็นเจ้าแรกในประเทศไทย
              ภายใต้ชื่อ “Power Ball”
              ที่เหมาะสำหรับการติดตั้งสายไฟทั้งแบบใต้ดินและบนดินรวมทั้งหน้างานที่เข้าถึงได้ยาก
            </li>
            <li className="list-disc">
              เรามีการจัดอบรมเรื่องความปลอดภัยเป็นประจำ
              เพื่อเป็นการสอนใช้งานเครื่องจักรอย่างไรให้ปลอดภัยและพัฒนาทักษะของพนักงานให้มีประสิทธิภาพสูงสุด
              นอกจากนั้นเรายังมีบริการจัดอบรมความปลอดภัยให้กับลูกค้าที่ต้องการใช้งานเครื่องจักรหน้างานอีกด้วย
            </li>
            <li className="list-disc">
              เรามีระบบ คุ้มครองความเสียหาย หรือ Compensation
              เพื่อให้ลูกค้าใช้งานเครื่องจักรของเราได้อย่างอุ่นใจด้วยค่าบริการเพียงเล็กน้อย
            </li>
          </ul>
          <p>
            ในงานก่อสร้างนั้นสิ่งสำคัญที่สุดคือความปลอดภัยและมาตรฐานของอุปกรณ์ก่อสร้าง
            การเลือกเครื่องจักรในการก่อสร้างให้มีประสิทธิภาพสูงสุดนั้น
            จึงเป็นสิ่งสำคัญอย่างมากที่ส่งผลกับผู้ใช้งานโดยตรง
            เพื่อความปลอดภัยของผู้ใช้งาน บริษัท เร้นท์ (ประเทศไทย) จำกัด
          </p>
          <p>
            ไม่ใช่แค่บริษัทที่ให้เช่าเครื่องจักรทั่วไปแต่ยังมีการอบรมและสอนการใช้เครื่องจักรอย่างถูกต้องอีกด้วย
            เพื่อความปลอดภัยของผู้ใช้งานและลดความเสียหายที่อาจเกิดขึ้นในงานก่อสร้าง
          </p>
          <p>สนใจติดต่อสอบถามบริการเพิ่มเติมได้ที่ โทร : 02-017-7200</p>
        </div>
      </div>
    </>
  );
}
