import Cover from "@/components/main/Cover/Cover";
import Loading from "@/components/main/Loading/Loading";
import Image from "next/image";

export default function historyPage() {
    return (
        <>
            <Loading />
            <Cover
                pageName={"ประวัติบริษัท"}
                prevPage={{ pageName: "หน้าแรก", url: "/" }}
            />
            <div className="container mx-auto mt-10 mb-20">
                <div className="grid grid-cols-1 md:grid-cols-12 gap-4">
                    <div className="col-span-4 flex justify-center align-middle">
                        <Image src="/Rectangle 106.png" alt="rent" width="300" height="180"/>
                    </div>
                    <div className="col-span-8">
                        <h1 className="text-3xl font-bold">บริษัท เร้นท์ (ประเทศไทย) จำกัด</h1>
                        <p className="text-lg mt-6 indent-15">หากคุณต้องการ เช่าเครื่องจักร และเครื่องมือสำหรับใช้ในงานก่อสร้าง เราคือ บริษัทให้บริการเช่าเครื่องจักร งานก่อสร้าง ที่มีสินค้าให้เช่ากว่า 460 ประเภท เป็นจำนวนกว่า 5,000 ชิ้น และสามารถนำเครื่องจักรที่ยังไม่เป็นที่รู้จักในประเทศไทยเข้ามาปล่อยเช่าได้อย่างรวดเร็ว ในฐานะผู้บุกเบิกตลาดงานเช่า และยังเป็นบริษัทเพียงเจ้าเดียวในประเทศไทยที่มีเครื่อง ทดสอบอุปกรณ์ยก ปฏิบัติงานด้วยความปลอดภัย รวดเร็ว และใส่ใจสิ่งแวดล้อม</p>
                    </div>
                </div>
                <div className="grid grid-cols-1 mt-6">
                    <div className="col-span-12">
                        <h2 className="text-2xl font-bold">พื้นที่บริการเช่าเครื่องจักรก่อสร้างและอุปกรณ์ต่าง ๆ</h2>
                        <p className="text-lg mt-4">เราพร้อมให้บริการท่านครอบคลุม โดยเน้นบริเวณภาคตะวันออกและภาคกลางเป็นหลักไม่ว่าจะเป็น</p>
                        <ul className="list-disc ml-6 mt-4 text-lg">
                            <li>ภาคกลาง ให้เช่าเครื่องจักรสมุทรปราการ กรุงเทพ และปริมณฑลทุกพื้นที่ ให้เช่าเครื่องจักรปทุมธานี ให้เช่าเครื่องจักรอยุธยา ฯลฯ</li>
                            <li>ภาคตะวันออก ให้เช่าเครื่องจักร ชลบุรี ให้เช่าเครื่องจักร ระยอง ให้เช่าเครื่องจักร มาบตาพุด ฯลฯ</li>
                            <li>ภาคตะวันออกเฉียงเหนือ ให้เช่าเครื่องจักร ขอนแก่น นครราชสีมา ฯลฯ</li>
                            <li>ภาคตะวันตก ให้เช่าเครื่องจักร ประจวบคีรีขันธ์ กาญจนบุรี ฯลฯ</li>
                            <li>ภาคเหนือและภาคใต้จะอยู่ห่างไกลจากสาขาของเรา แต่สามารถพิจารณาให้บริการเช่าได้เป็นกรณีไป โดยจะให้เช่าในลักษณะที่ไม่มีบริการซ่อมบำรุง</li>
                        </ul>
                    </div>
                </div>
                <div className="grid grid-cols-1 my-10">
                    <Image src="/Rectangle 114.png" className="w-full" alt="rent" width="1200" height="180"/>
                </div>
                <div className="grid grid-cols-1 mt-6">
                    <div className="col-span-12">
                        <h2 className="text-2xl font-bold">ทำไมถึงต้องเลือกเช่าเครื่องจักรกับเรา</h2>
                        <ul className="list-disc ml-10 mt-4 text-lg">
                            <li>เรามีสินค้าที่ให้บริการ เครื่องจักรให้เช่า ที่หลากหลาย 450 ประเภท เป็นจำนวนกว่า 5,000 ชิ้น</li>
                            <li>เรามีการจัดตั้งศูนย์ซ่อมบำรุงเครื่องจักร มุ่งเน้นให้บริการ ให้เช่าเครื่องจักรคุณภาพดี แก่ลูกค้า</li>
                            <li>เราได้จัดตั้งหน่วยงานพิเศษเพื่อดูแลและเน้นควบคุมคุณภาพของเครื่องมือเฉพาะทาง รวมถึงมีการสอบเทียบคุณภาพและความแม่นยำสำหรับอุปกรณ์วัดต่าง ๆ อย่างสม่ำเสมอ เน้นถึงความปลอดภัยแก่ลูกค้าเป็นหลัก</li>
                            <li>เรานำเข้าเครื่องมือช่วยในการดันสายไฟมาจากประเทศญี่ปุ่นเป็นเจ้าแรกในประเทศไทย ภายใต้ชื่อ “Power Ball” ที่เหมาะสำหรับการติดตั้งสายไฟทั้งแบบใต้ดินและบนดินรวมทั้งหน้างานที่เข้าถึงได้ยาก</li>
                            <li>เรามีการจัดอบรมเรื่องความปลอดภัยเป็นประจำ เพื่อเป็นการสอนใช้งานเครื่องจักรอย่างไรให้ปลอดภัยและพัฒนาทักษะของพนักงานให้มีประสิทธิภาพสูงสุด นอกจากนั้นเรายังมีบริการจัดอบรมความปลอดภัยให้กับลูกค้าที่ต้องการใช้งานเครื่องจักรหน้างานอีกด้วย</li>
                            <li>เรามีระบบ คุ้มครองความเสียหาย หรือ Compensation เพื่อให้ลูกค้าใช้งานเครื่องจักรของเราได้อย่างอุ่นใจด้วยค่าบริการเพียงเล็กน้อย</li>
                        </ul>
                        <p className="mt-4 text-lg indent-15">
                            ในงานก่อสร้างนั้นสิ่งสำคัญที่สุดคือความปลอดภัยและมาตรฐานของอุปกรณ์ก่อสร้าง การเลือกเครื่องจักรในการก่อสร้างให้มีประสิทธิภาพสูงสุด นั้น จึงเป็นสิ่งสำคัญอย่างมากที่ส่งผลกับผู้ใช้งานโดยตรง เพื่อความปลอดภัยของผู้ใช้งาน บริษัท เร้นท์ (ประเทศไทย) จำกัดไม่ใช่แค่บริษัทที่ให้เช่า เครื่องจักรทั่วไปแต่ยังมีการอบรม และสอนการใช้เครื่องจักรอย่างถูกต้องอีกด้วยเพื่อความปลอดภัยของผู้ใช้งานและลดความเสียหายที่อาจเกิด ขึ้นในงานก่อสร้างสนใจติดต่อสอบถามบริการเพิ่มเติมได้ที่ โทร : 02-017-7200
                        </p>
                    </div>
                </div>
            </div>
        </>
    );
}
